data/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 	xmlns:urn="urn:sap-com:document:sap:rfc:functions"><soapenv:Header /><soapenv:Body><urn:RFC_CALL_TRANSACTION_USING><MODE>S</MODE><TCODE>F-63</TCODE><BT_DATA><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0100</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/00</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BLDAT</FNAM><FVAL>07012020</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BUKRS</FNAM><FVAL>1400</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BUDAT</FNAM><FVAL>08012020</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-MONAT</FNAM><FVAL>01</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-WAERS</FNAM><FVAL>EUR</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-XBLNR</FNAM><FVAL>Take8</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWBS</FNAM><FVAL>31</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWKO</FNAM><FVAL>5020749</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0302</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ZK</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-WRBTR</FNAM><FVAL>150</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-ZTERM</FNAM><FVAL>Z030</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0332</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/00</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWBS</FNAM><FVAL>40</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWKO</FNAM><FVAL>4689022</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ZK</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-WRBTR</FNAM><FVAL>150</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-MWSKZ</FNAM><FVAL>V0</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-SGTXT</FNAM><FVAL></FVAL></item><item><PROGRAM>SAPLKACB</PROGRAM><DYNPRO>0002</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ENTE</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>330</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=PI</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_CURSOR</FNAM><FVAL>RF05V-ANZDT(01)</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0302</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=STER</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=DELZ</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>BSET-FWSTE(01)</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSET-FWSTE(01)</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSET-MWSKZ(01)</FNAM><FVAL>V0</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-BSCHL(01)</FNAM><FVAL>40</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=GO</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0302</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=BP</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/EEND</FVAL></item><item><PROGRAM>SAPLSPO1</PROGRAM><DYNPRO>0200</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=Yes</FVAL></item></BT_DATA><L_ERRORS/></urn:RFC_CALL_TRANSACTION_USING></soapenv:Body></soapenv:Envelope>
